Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.1/atdf/PIC32CX1025SG41100.atdf
          <instance name="SERCOM6">
            <register-group name="SERCOM6" name-in-module="SERCOM" address-space="base" offset="0x43000800"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PC13" ioset="4 5"/>
              <signal group="PAD" index="0" function="C" pad="PC16" ioset="1"/>
              <signal group="PAD" index="1" function="D" pad="PC12" ioset="4 5"/>
              <signal group="PAD" index="1" function="C" pad="PC05" ioset="2"/>
              <signal group="PAD" index="1" function="C" pad="PC17" ioset="1"/>
              <signal group="PAD" index="2" function="D" pad="PC14" ioset="4"/>
              <signal group="PAD" index="2" function="C" pad="PC06" ioset="2"/>
              <signal group="PAD" index="2" function="C" pad="PC10" ioset="5"/>
              <signal group="PAD" index="2" function="C" pad="PC18" ioset="1"/>
              <signal group="PAD" index="3" function="D" pad="PC15" ioset="4"/>
              <signal group="PAD" index="3" function="C" pad="PC07" ioset="2"/>
              <signal group="PAD" index="3" function="C" pad="PC11" ioset="5"/>
              <signal group="PAD" index="3" function="C" pad="PC19" ioset="1"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DLY_COMPENSATION" value="1" caption="Compensates for a fast DLY50 element. Assuming 20ns"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="16" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="17" caption="Index of DMA TX trigger"/>
              <param name="FIFO_DEPTH_POWER" value="1" caption="2^FIFO_DEPTH_POWER gives rx FIFO depth."/>
              <param name="GCLK_ID_CORE" value="36"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0" caption="Retention supported?"/>
              <param name="SE_CNT" value="1" caption="SE counter included?"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="SPI_HW_SS_CTRL" value="1" caption="Master _SS hardware control implemented?"/>
              <param name="SPI_ICSPACE_EXT" value="1" caption="SPI inter character space implemented?"/>
              <param name="SPI_OZMO" value="0" caption="OZMO features implemented?"/>
              <param name="SPI_WAKE_ON_SSL" value="1" caption="_SS low detect implemented?"/>
              <param name="SPI_TX_READY_INT_SRC" value="70" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="71" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="72" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="73" caption="SPI ERROR Interrupt"/>
              <param name="TTBIT_EXTENSION" value="1" caption="32-bit extension implemented?"/>
              <param name="I2CM" value="1" caption="I2C Master mode implemented?"/>
              <param name="I2CS" value="1" caption="I2C Slave mode implemented?"/>
              <param name="I2CS_AUTO_ACK" value="1" caption="I2C slave automatic acknowledge implemented?"/>
              <param name="I2CS_GROUP_CMD" value="1" caption="I2C slave group command implemented?"/>
              <param name="I2CS_SDASETUP_CNT_SIZE" value="8" caption="I2CS sda setup count size"/>
              <param name="I2CS_SDASETUP_SIZE" value="4" caption="I2CS sda setup size"/>
              <param name="I2CS_SUDAT" value="1" caption="I2C slave SDA setup implemented?"/>
              <param name="I2C_FASTMP" value="1" caption="I2C fast mode plus implemented?"/>
              <param name="I2C_HSMODE" value="1" caption="USART mode implemented?"/>
              <param name="I2C_SCLSM_MODE" value="1" caption="I2C SCL clock stretch mode implemented?"/>
              <param name="I2C_SMB_TIMEOUTS" value="1" caption="I2C SMBus timeouts implemented?"/>
              <param name="I2C_TENBIT_ADR" value="1" caption="I2C ten bit enabled?"/>
              <param name="I2C_0_INT_SRC" value="70" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="71" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="72" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="73" caption="I2C 3 Interrupt"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_COLDET" value="1" caption="USART collision detection implemented?"/>
              <param name="USART_FLOW_CTRL" value="1" caption="USART flow control implemented?"/>
              <param name="USART_FRAC_BAUD" value="1" caption="USART fractional BAUD implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="USART_SAMPA_EXT" value="1" caption="USART sample adjust implemented?"/>
              <param name="USART_SAMPR_EXT" value="1" caption="USART oversampling adjustment implemented?"/>
              <param name="USART_TX_READY_INT_SRC" value="70" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="71" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="72" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="73" caption="USART ERROR Interrupt"/>
              <param name="INSTANCE_ID" value="98" caption="Instance index for SERCOM6"/>
            </parameters>
          </instance>
          <instance name="SERCOM7">
            <register-group name="SERCOM7" name-in-module="SERCOM" address-space="base" offset="0x43000C00"/>
            <signals>
              <signal group="PAD" index="0" function="D" pad="PB21" ioset="4"/>
              <signal group="PAD" index="0" function="C" pad="PB30" ioset="5"/>
              <signal group="PAD" index="0" function="C" pad="PC12" ioset="1 3"/>
              <signal group="PAD" index="1" function="D" pad="PB20" ioset="4"/>
              <signal group="PAD" index="1" function="C" pad="PB31" ioset="5"/>
              <signal group="PAD" index="1" function="C" pad="PC13" ioset="1 3"/>
              <signal group="PAD" index="2" function="D" pad="PB18" ioset="4"/>
              <signal group="PAD" index="2" function="D" pad="PC10" ioset="3"/>
              <signal group="PAD" index="2" function="C" pad="PC14" ioset="1"/>
              <signal group="PAD" index="2" function="C" pad="PA30" ioset="5"/>
              <signal group="PAD" index="3" function="D" pad="PB19" ioset="4"/>
              <signal group="PAD" index="3" function="D" pad="PC11" ioset="3"/>
              <signal group="PAD" index="3" function="C" pad="PC15" ioset="1"/>
              <signal group="PAD" index="3" function="C" pad="PA31" ioset="5"/>
            </signals>
            <parameters>
              <param name="CLK_REDUCTION" value="1" caption="Reduce clock options to pin 1 for SPI and USART"/>
              <param name="DLY_COMPENSATION" value="1" caption="Compensates for a fast DLY50 element. Assuming 20ns"/>
              <param name="DMA" value="1" caption="DMA support implemented?"/>
              <param name="DMAC_ID_RX" value="18" caption="Index of DMA RX trigger"/>
              <param name="DMAC_ID_TX" value="19" caption="Index of DMA TX trigger"/>
              <param name="FIFO_DEPTH_POWER" value="1" caption="2^FIFO_DEPTH_POWER gives rx FIFO depth."/>
              <param name="GCLK_ID_CORE" value="37"/>
              <param name="GCLK_ID_SLOW" value="3"/>
              <param name="INT_MSB" value="6"/>
              <param name="PMSB" value="3"/>
              <param name="RETENTION_SUPPORT" value="0" caption="Retention supported?"/>
              <param name="SE_CNT" value="1" caption="SE counter included?"/>
              <param name="SPI" value="1" caption="SPI mode implemented?"/>
              <param name="SPI_HW_SS_CTRL" value="1" caption="Master _SS hardware control implemented?"/>
              <param name="SPI_ICSPACE_EXT" value="1" caption="SPI inter character space implemented?"/>
              <param name="SPI_OZMO" value="0" caption="OZMO features implemented?"/>
              <param name="SPI_WAKE_ON_SSL" value="1" caption="_SS low detect implemented?"/>
              <param name="SPI_TX_READY_INT_SRC" value="74" caption="SPI TX READY Interrupt"/>
              <param name="SPI_TX_COMPLETE_INT_SRC" value="75" caption="SPI TX COMPLETE Interrupt"/>
              <param name="SPI_RX_INT_SRC" value="76" caption="SPI RX Interrupt"/>
              <param name="SPI_ERROR_INT_SRC" value="77" caption="SPI ERROR Interrupt"/>
              <param name="TTBIT_EXTENSION" value="1" caption="32-bit extension implemented?"/>
              <param name="I2CM" value="1" caption="I2C Master mode implemented?"/>
              <param name="I2CS" value="1" caption="I2C Slave mode implemented?"/>
              <param name="I2CS_AUTO_ACK" value="1" caption="I2C slave automatic acknowledge implemented?"/>
              <param name="I2CS_GROUP_CMD" value="1" caption="I2C slave group command implemented?"/>
              <param name="I2CS_SDASETUP_CNT_SIZE" value="8" caption="I2CS sda setup count size"/>
              <param name="I2CS_SDASETUP_SIZE" value="4" caption="I2CS sda setup size"/>
              <param name="I2CS_SUDAT" value="1" caption="I2C slave SDA setup implemented?"/>
              <param name="I2C_FASTMP" value="1" caption="I2C fast mode plus implemented?"/>
              <param name="I2C_HSMODE" value="1" caption="USART mode implemented?"/>
              <param name="I2C_SCLSM_MODE" value="1" caption="I2C SCL clock stretch mode implemented?"/>
              <param name="I2C_SMB_TIMEOUTS" value="1" caption="I2C SMBus timeouts implemented?"/>
              <param name="I2C_TENBIT_ADR" value="1" caption="I2C ten bit enabled?"/>
              <param name="I2C_0_INT_SRC" value="74" caption="I2C 0 Interrupt"/>
              <param name="I2C_1_INT_SRC" value="75" caption="I2C 1 Interrupt"/>
              <param name="I2C_2_INT_SRC" value="76" caption="I2C 2 Interrupt"/>
              <param name="I2C_3_INT_SRC" value="77" caption="I2C 3 Interrupt"/>
              <param name="USART" value="1" caption="USART mode implemented?"/>
              <param name="USART_AUTOBAUD" value="1" caption="USART autobaud implemented?"/>
              <param name="USART_COLDET" value="1" caption="USART collision detection implemented?"/>
              <param name="USART_FLOW_CTRL" value="1" caption="USART flow control implemented?"/>
              <param name="USART_FRAC_BAUD" value="1" caption="USART fractional BAUD implemented?"/>
              <param name="USART_IRDA" value="1" caption="USART IrDA implemented?"/>
              <param name="USART_ISO7816" value="1" caption="USART ISO7816 mode implemented?"/>
              <param name="USART_LIN_MASTER" value="1" caption="USART LIN Master mode implemented?"/>
              <param name="USART_RS485" value="1" caption="USART RS485 mode implemented?"/>
              <param name="USART_SAMPA_EXT" value="1" caption="USART sample adjust implemented?"/>
              <param name="USART_SAMPR_EXT" value="1" caption="USART oversampling adjustment implemented?"/>
              <param name="USART_TX_READY_INT_SRC" value="74" caption="USART TX READY Interrupt"/>
              <param name="USART_TX_COMPLETE_INT_SRC" value="75" caption="USART TX COMPLETE Interrupt"/>
              <param name="USART_RX_INT_SRC" value="76" caption="USART RX Interrupt"/>
              <param name="USART_ERROR_INT_SRC" value="77" caption="USART ERROR Interrupt"/>
              <param name="INSTANCE_ID" value="99" caption="Instance index for SERCOM7"/>
            </parameters>
          </instance>
        </module>
