Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.1/atdf/PIC32CX1025SG41100.atdf
        <register name="DATA" offset="0x10" rw="W" access="WSYNC" size="2" count="2" initval="0x0000" caption="DAC n Data">
          <bitfield name="DATA" caption="DAC0 Data" mask="0xFFFF"/>
        </register>
        <register name="DATABUF" offset="0x14" rw="W" access="WSYNC" size="2" count="2" initval="0x0000" caption="DAC n Data Buffer">
          <bitfield name="DATABUF" caption="DAC0 Data Buffer" mask="0xFFFF"/>
        </register>
        <register name="DBGCTRL" offset="0x18" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run" mask="0x1"/>
        </register>
        <register name="RESULT" offset="0x1C" rw="R" size="2" count="2" initval="0x0000" caption="Filter Result">
          <bitfield name="RESULT" caption="Filter Result" mask="0xFFFF"/>
        </register>
      </register-group>
      <value-group name="DAC_CTRLB__REFSEL">
        <value name="VREFAU" caption="External reference unbuffered" value="0"/>
        <value name="AVDD" caption="Analog supply" value="1"/>
        <value name="VREFAB" caption="External reference buffered" value="2"/>
        <value name="INTREF" caption="Internal bandgap reference" value="3"/>
      </value-group>
      <value-group name="DAC_DACCTRL__CCTRL">
        <value name="CC100K" caption="100kSPS" value="0x0"/>
        <value name="CC1M" caption="500kSPS" value="0x1"/>
        <value name="CC12M" caption="1MSPS" value="0x2"/>
      </value-group>
      <value-group name="DAC_DACCTRL__OSR">
        <value name="OSR_1" caption="No Over Sampling" value="0"/>
        <value name="OSR_2" caption="2x Over Sampling Ratio" value="1"/>
        <value name="OSR_4" caption="4x Over Sampling Ratio" value="2"/>
        <value name="OSR_8" caption="8x Over Sampling Ratio" value="3"/>
        <value name="OSR_16" caption="16x Over Sampling Ratio" value="4"/>
        <value name="OSR_32" caption="32x Over Sampling Ratio" value="5"/>
      </value-group>
      <value-group name="DAC_DACCTRL__REFRESH">
        <value name="REFRESH_0" caption="Do not Refresh" value="0"/>
        <value name="REFRESH_1" caption="Refresh every 30 us" value="1"/>
        <value name="REFRESH_2" caption="Refresh every 60 us" value="2"/>
        <value name="REFRESH_3" caption="Refresh every 90 us" value="3"/>
        <value name="REFRESH_4" caption="Refresh every 120 us" value="4"/>
        <value name="REFRESH_5" caption="Refresh every 150 us" value="5"/>
        <value name="REFRESH_6" caption="Refresh every 180 us" value="6"/>
        <value name="REFRESH_7" caption="Refresh every 210 us" value="7"/>
        <value name="REFRESH_8" caption="Refresh every 240 us" value="8"/>
        <value name="REFRESH_9" caption="Refresh every 270 us" value="9"/>
        <value name="REFRESH_10" caption="Refresh every 300 us" value="10"/>
        <value name="REFRESH_11" caption="Refresh every 330 us" value="11"/>
        <value name="REFRESH_12" caption="Refresh every 360 us" value="12"/>
        <value name="REFRESH_13" caption="Refresh every 390 us" value="13"/>
        <value name="REFRESH_14" caption="Refresh every 420 us" value="14"/>
        <value name="REFRESH_15" caption="Refresh every 450 us" value="15"/>
      </value-group>
    </module>
    <module name="DMAC" id="U2503" version="1.0.1" caption="Direct Memory Access Controller">
      <register-group name="CHANNEL" size="0x10">
        <register name="CHCTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Channel n Control A">
          <bitfield name="SWRST" caption="Channel Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Channel Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Channel Run in Standby" mask="0x40"/>
          <bitfield name="TRIGSRC" caption="Trigger Source" mask="0x7F00" values="DMAC_CHCTRLA__TRIGSRC"/>
          <bitfield name="TRIGACT" caption="Trigger Action" mask="0x300000" values="DMAC_CHCTRLA__TRIGACT"/>
          <bitfield name="BURSTLEN" caption="Burst Length" mask="0xF000000" values="DMAC_CHCTRLA__BURSTLEN"/>
          <bitfield name="THRESHOLD" caption="FIFO Threshold" mask="0x30000000" values="DMAC_CHCTRLA__THRESHOLD"/>
        </register>
        <register name="CHCTRLB" offset="0x4" rw="RW" size="1" initval="0x00" caption="Channel n Control B">
          <bitfield name="CMD" caption="Software Command" mask="0x3" values="DMAC_CHCTRLB__CMD"/>
        </register>
        <register name="CHPRILVL" offset="0x5" rw="RW" size="1" initval="0x00" caption="Channel n Priority Level">
          <bitfield name="PRILVL" caption="Channel Priority Level" mask="0x3" values="DMAC_CHPRILVL__PRILVL"/>
        </register>
        <register name="CHEVCTRL" offset="0x6" rw="RW" size="1" initval="0x00" caption="Channel n Event Control">
          <bitfield name="EVACT" caption="Channel Event Input Action" mask="0x7" values="DMAC_CHEVCTRL__EVACT"/>
          <bitfield name="EVOMODE" caption="Channel Event Output Mode" mask="0x30" values="DMAC_CHEVCTRL__EVOMODE"/>
          <bitfield name="EVIE" caption="Channel Event Input Enable" mask="0x40"/>
          <bitfield name="EVOE" caption="Channel Event Output Enable" mask="0x80"/>
        </register>
        <register name="CHINTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel n Interrupt Enable Clear">
          <bitfield name="TERR" caption="Channel Transfer Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend Interrupt Enable" mask="0x4"/>
        </register>
        <register name="CHINTENSET" offset="0xD" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel n Interrupt Enable Set">
          <bitfield name="TERR" caption="Channel Transfer Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend Interrupt Enable" mask="0x4"/>
        </register>
