Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-SG41_DFP/1.0.1/atdf/PIC32CX1025SG41100.atdf
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
          <bitfield name="PAC_" caption="PAC" mask="0x1"/>
          <bitfield name="PM_" caption="PM" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM" mask="0x800"/>
          <bitfield name="SERCOM0_" caption="SERCOM0" mask="0x1000"/>
          <bitfield name="SERCOM1_" caption="SERCOM1" mask="0x2000"/>
          <bitfield name="TC0_" caption="TC0" mask="0x4000"/>
          <bitfield name="TC1_" caption="TC1" mask="0x8000"/>
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
          <bitfield name="USB_" caption="USB" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL" mask="0x4"/>
          <bitfield name="CMCC_" caption="CMCC" mask="0x8"/>
          <bitfield name="PORT_" caption="PORT" mask="0x10"/>
          <bitfield name="DMAC_" caption="DMAC" mask="0x20"/>
          <bitfield name="EVSYS_" caption="EVSYS" mask="0x80"/>
          <bitfield name="SERCOM2_" caption="SERCOM2" mask="0x200"/>
          <bitfield name="SERCOM3_" caption="SERCOM3" mask="0x400"/>
          <bitfield name="TCC0_" caption="TCC0" mask="0x800"/>
          <bitfield name="TCC1_" caption="TCC1" mask="0x1000"/>
          <bitfield name="TC2_" caption="TC2" mask="0x2000"/>
          <bitfield name="TC3_" caption="TC3" mask="0x4000"/>
          <bitfield name="RAMECC_" caption="RAMECC" mask="0x10000"/>
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
          <bitfield name="CAN0_" caption="CAN0" mask="0x1"/>
          <bitfield name="CAN1_" caption="CAN1" mask="0x2"/>
          <bitfield name="GMAC_" caption="GMAC" mask="0x4"/>
          <bitfield name="TCC2_" caption="TCC2" mask="0x8"/>
          <bitfield name="TCC3_" caption="TCC3" mask="0x10"/>
          <bitfield name="TC4_" caption="TC4" mask="0x20"/>
          <bitfield name="TC5_" caption="TC5" mask="0x40"/>
          <bitfield name="PDEC_" caption="PDEC" mask="0x80"/>
          <bitfield name="AC_" caption="AC" mask="0x100"/>
          <bitfield name="AES_" caption="AES" mask="0x200"/>
          <bitfield name="TRNG_" caption="TRNG" mask="0x400"/>
          <bitfield name="ICM_" caption="ICM" mask="0x800"/>
          <bitfield name="PUKCC_" caption="PUKCC" mask="0x1000"/>
          <bitfield name="QSPI_" caption="QSPI" mask="0x2000"/>
          <bitfield name="CCL_" caption="CCL" mask="0x4000"/>
        </register>
        <register name="INTFLAGD" offset="0x20" rw="RW" size="4" atomic-op="clear:INTFLAGD" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge D">
          <bitfield name="SERCOM4_" caption="SERCOM4" mask="0x1"/>
          <bitfield name="SERCOM5_" caption="SERCOM5" mask="0x2"/>
          <bitfield name="SERCOM6_" caption="SERCOM6" mask="0x4"/>
          <bitfield name="SERCOM7_" caption="SERCOM7" mask="0x8"/>
          <bitfield name="TCC4_" caption="TCC4" mask="0x10"/>
          <bitfield name="TC6_" caption="TC6" mask="0x20"/>
          <bitfield name="TC7_" caption="TC7" mask="0x40"/>
          <bitfield name="ADC0_" caption="ADC0" mask="0x80"/>
          <bitfield name="ADC1_" caption="ADC1" mask="0x100"/>
          <bitfield name="DAC_" caption="DAC" mask="0x200"/>
          <bitfield name="I2S_" caption="I2S" mask="0x400"/>
          <bitfield name="PCC_" caption="PCC" mask="0x800"/>
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x00010000" caption="Peripheral write protection status - Bridge A">
          <bitfield name="PAC_" caption="PAC APB Protect Enable" mask="0x1"/>
          <bitfield name="PM_" caption="PM APB Protect Enable" mask="0x2"/>
          <bitfield name="MCLK_" caption="MCLK APB Protect Enable" mask="0x4"/>
          <bitfield name="RSTC_" caption="RSTC APB Protect Enable" mask="0x8"/>
          <bitfield name="OSCCTRL_" caption="OSCCTRL APB Protect Enable" mask="0x10"/>
          <bitfield name="OSC32KCTRL_" caption="OSC32KCTRL APB Protect Enable" mask="0x20"/>
          <bitfield name="SUPC_" caption="SUPC APB Protect Enable" mask="0x40"/>
          <bitfield name="GCLK_" caption="GCLK APB Protect Enable" mask="0x80"/>
          <bitfield name="WDT_" caption="WDT APB Protect Enable" mask="0x100"/>
          <bitfield name="RTC_" caption="RTC APB Protect Enable" mask="0x200"/>
          <bitfield name="EIC_" caption="EIC APB Protect Enable" mask="0x400"/>
          <bitfield name="FREQM_" caption="FREQM APB Protect Enable" mask="0x800"/>
          <bitfield name="SERCOM0_" caption="SERCOM0 APB Protect Enable" mask="0x1000"/>
          <bitfield name="SERCOM1_" caption="SERCOM1 APB Protect Enable" mask="0x2000"/>
          <bitfield name="TC0_" caption="TC0 APB Protect Enable" mask="0x4000"/>
          <bitfield name="TC1_" caption="TC1 APB Protect Enable" mask="0x8000"/>
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000002" caption="Peripheral write protection status - Bridge B">
          <bitfield name="USB_" caption="USB APB Protect Enable" mask="0x1"/>
          <bitfield name="DSU_" caption="DSU APB Protect Enable" mask="0x2"/>
          <bitfield name="NVMCTRL_" caption="NVMCTRL APB Protect Enable" mask="0x4"/>
          <bitfield name="CMCC_" caption="CMCC APB Protect Enable" mask="0x8"/>
          <bitfield name="PORT_" caption="PORT APB Protect Enable" mask="0x10"/>
          <bitfield name="DMAC_" caption="DMAC APB Protect Enable" mask="0x20"/>
          <bitfield name="EVSYS_" caption="EVSYS APB Protect Enable" mask="0x80"/>
          <bitfield name="SERCOM2_" caption="SERCOM2 APB Protect Enable" mask="0x200"/>
          <bitfield name="SERCOM3_" caption="SERCOM3 APB Protect Enable" mask="0x400"/>
          <bitfield name="TCC0_" caption="TCC0 APB Protect Enable" mask="0x800"/>
          <bitfield name="TCC1_" caption="TCC1 APB Protect Enable" mask="0x1000"/>
          <bitfield name="TC2_" caption="TC2 APB Protect Enable" mask="0x2000"/>
          <bitfield name="TC3_" caption="TC3 APB Protect Enable" mask="0x4000"/>
          <bitfield name="RAMECC_" caption="RAMECC APB Protect Enable" mask="0x10000"/>
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge C">
          <bitfield name="CAN0_" caption="CAN0 APB Protect Enable" mask="0x1"/>
          <bitfield name="CAN1_" caption="CAN1 APB Protect Enable" mask="0x2"/>
          <bitfield name="GMAC_" caption="GMAC APB Protect Enable" mask="0x4"/>
          <bitfield name="TCC2_" caption="TCC2 APB Protect Enable" mask="0x8"/>
          <bitfield name="TCC3_" caption="TCC3 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC4_" caption="TC4 APB Protect Enable" mask="0x20"/>
          <bitfield name="TC5_" caption="TC5 APB Protect Enable" mask="0x40"/>
          <bitfield name="PDEC_" caption="PDEC APB Protect Enable" mask="0x80"/>
          <bitfield name="AC_" caption="AC APB Protect Enable" mask="0x100"/>
          <bitfield name="AES_" caption="AES APB Protect Enable" mask="0x200"/>
          <bitfield name="TRNG_" caption="TRNG APB Protect Enable" mask="0x400"/>
          <bitfield name="ICM_" caption="ICM APB Protect Enable" mask="0x800"/>
          <bitfield name="PUKCC_" caption="PUKCC APB Protect Enable" mask="0x1000"/>
          <bitfield name="QSPI_" caption="QSPI APB Protect Enable" mask="0x2000"/>
          <bitfield name="CCL_" caption="CCL APB Protect Enable" mask="0x4000"/>
        </register>
        <register name="STATUSD" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge D">
          <bitfield name="SERCOM4_" caption="SERCOM4 APB Protect Enable" mask="0x1"/>
          <bitfield name="SERCOM5_" caption="SERCOM5 APB Protect Enable" mask="0x2"/>
          <bitfield name="SERCOM6_" caption="SERCOM6 APB Protect Enable" mask="0x4"/>
          <bitfield name="SERCOM7_" caption="SERCOM7 APB Protect Enable" mask="0x8"/>
          <bitfield name="TCC4_" caption="TCC4 APB Protect Enable" mask="0x10"/>
          <bitfield name="TC6_" caption="TC6 APB Protect Enable" mask="0x20"/>
          <bitfield name="TC7_" caption="TC7 APB Protect Enable" mask="0x40"/>
          <bitfield name="ADC0_" caption="ADC0 APB Protect Enable" mask="0x80"/>
          <bitfield name="ADC1_" caption="ADC1 APB Protect Enable" mask="0x100"/>
          <bitfield name="DAC_" caption="DAC APB Protect Enable" mask="0x200"/>
          <bitfield name="I2S_" caption="I2S APB Protect Enable" mask="0x400"/>
          <bitfield name="PCC_" caption="PCC APB Protect Enable" mask="0x800"/>
        </register>
      </register-group>
      <value-group name="PAC_WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
